In [75]:
import pandas as pd

In [76]:
df = pd.read_csv("/Users/vishalbarad/Desktop/Python/classification/naive_bayes/titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0.0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1.0
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1.0
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1.0
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0.0

In [77]:
df1 = df.drop(['PassengerId','SibSp','Name','Ticket','Parch','Cabin','Embarked'],axis=1).head()

In [78]:
input = df1.drop('Survived',axis=1)
target = df1['Survived'].astype(int)

In [79]:
input.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [80]:
target.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [81]:
dummy = pd.get_dummies(input['Sex'])

In [82]:
input = pd.concat([input,dummy],axis=1)
input.drop('Sex',axis=1,inplace=True)

In [83]:
input.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [84]:
input.columns[input.isna().any()]

Index([], dtype='object')

In [85]:
from sklearn.model_selection import train_test_split

In [93]:
x_train, x_test, y_train, y_test = train_test_split(input,target,test_size=0.5)

In [94]:
x_test

   Pclass   Age    Fare  female  male
3       1  35.0  53.100       1     0
2       3  26.0   7.925       1     0
0       3  22.0   7.250       0     1

In [95]:
from sklearn.naive_bayes import GaussianNB

In [96]:
model = GaussianNB()

In [97]:
model.fit(x_train,y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [98]:
model.score(x_test,y_test)

0.6666666666666666

In [99]:
model.predict(x_test)

array([1, 0, 0])

In [100]:
y_test

3    1
2    1
0    0
Name: Survived, dtype: int64

In [101]:
model.predict_proba(x_test)

array([[0., 1.],
       [1., 0.],
       [1., 0.]])